#### Case Study 2
### üçï Pizza Runner PART 2 (Data cleaning)

Source : <a href='https://8weeksqlchallenge.com/case-study-2/'>8 Week SQL Challenge</a>

Load extension

In [1]:
%load_ext sql

Initialize the connection to existing **pizza_runner** database

In [134]:
%sql sqlite:///datasets/pizza_runner.sqlite

There are 6 tables with **pizza_runner**

In [135]:
%%sql
SELECT name
FROM sqlite_master
WHERE TYPE ='table'

 * sqlite:///datasets/pizza_runner.sqlite
Done.

[('runners',),
 ('customer_orders',),
 ('pizza_names',),
 ('pizza_recipes',),
 ('pizza_toppings',),
 ('runner_orders',)]

#### Entity Relationship Diagram

<img src = 'images/Pizza Runner.png'>

####  Data types  And Data Cleaning

**runners** has no null values and Data type is correct

In [136]:
%%sql
PRAGMA table_info(runners)

 * sqlite:///datasets/pizza_runner.sqlite
Done.

[(0, 'runner_id', 'INTERGER', 0, None, 0),
 (1, 'registration_date', 'DATE', 0, None, 0)]

In [137]:
%%sql
SELECT *
FROM runners

 * sqlite:///datasets/pizza_runner.sqlite
Done.

[(1, '2021-01-01'), (2, '2021-01-03'), (3, '2021-01-08'), (4, '2021-01-15')]

There are NULL and STRING 'null' values in columns *extras* and *exclusions* of **customer_orders**. Replacing with empty string.

In [138]:
%%sql
PRAGMA table_info(customer_orders)

 * sqlite:///datasets/pizza_runner.sqlite
Done.

[(0, 'order_id', 'INTEGER', 0, None, 0),
 (1, 'customer_id', 'INTEGER', 0, None, 0),
 (2, 'pizza_id', 'INTEGER', 0, None, 0),
 (3, 'exclusions', 'VARCHAR(4)', 0, None, 0),
 (4, 'extras', 'VARCHAR(4)', 0, None, 0),
 (5, 'order_time', 'TIMESTAMP', 0, None, 0)]

In [7]:
%%sql
SELECT *
FROM customer_orders

 * sqlite:///datasets/pizza_runner.sqlite
Done.

[(1, 101, 1, '', '', '2020-01-01 18:05:02'),
 (2, 101, 1, '', '', '2020-01-01 19:00:52'),
 (3, 102, 1, '', '', '2020-01-02 23:51:23'),
 (3, 102, 2, '', None, '2020-01-02 23:51:23'),
 (4, 103, 1, '4', '', '2020-01-04 13:23:46'),
 (4, 103, 1, '4', '', '2020-01-04 13:23:46'),
 (4, 103, 2, '4', '', '2020-01-04 13:23:46'),
 (5, 104, 1, 'null', '1', '2020-01-08 21:00:29'),
 (6, 101, 2, 'null', 'null', '2020-01-08 21:03:13'),
 (7, 105, 2, 'null', '1', '2020-01-08 21:20:29'),
 (8, 102, 1, 'null', 'null', '2020-01-09 23:54:33'),
 (9, 103, 1, '4', '1, 5', '2020-01-10 11:22:59'),
 (10, 104, 1, 'null', 'null', '2020-01-11 18:34:49'),
 (10, 104, 1, '2, 6', '1, 4', '2020-01-11 18:34:49')]

Replacing with Null values with empty string

In [40]:
%%sql
UPDATE customer_orders
SET extras = COALESCE(extras,'')
WHERE extras IS NULL

 * sqlite:///datasets/pizza_runner.sqlite
3 rows affected.

[]

Replacing string"null" with empty string

In [54]:
%%sql
UPDATE customer_orders
SET exclusions = ''
WHERE exclusions = 'null'

 * sqlite:///datasets/pizza_runner.sqlite
5 rows affected.

[]

In [56]:
%%sql
UPDATE customer_orders
SET extras = ''
WHERE extras = "null"

 * sqlite:///datasets/pizza_runner.sqlite
0 rows affected.

[]

In [139]:
%%sql
SELECT *
FROM customer_orders

 * sqlite:///datasets/pizza_runner.sqlite
Done.

[(1, 101, 1, '', '', '2020-01-01 18:05:02'),
 (2, 101, 1, '', '', '2020-01-01 19:00:52'),
 (3, 102, 1, '', '', '2020-01-02 23:51:23'),
 (3, 102, 2, '', '', '2020-01-02 23:51:23'),
 (4, 103, 1, '4', '', '2020-01-04 13:23:46'),
 (4, 103, 1, '4', '', '2020-01-04 13:23:46'),
 (4, 103, 2, '4', '', '2020-01-04 13:23:46'),
 (5, 104, 1, '', '1', '2020-01-08 21:00:29'),
 (6, 101, 2, '', '', '2020-01-08 21:03:13'),
 (7, 105, 2, '', '1', '2020-01-08 21:20:29'),
 (8, 102, 1, '', '', '2020-01-09 23:54:33'),
 (9, 103, 1, '4', '1, 5', '2020-01-10 11:22:59'),
 (10, 104, 1, '', '', '2020-01-11 18:34:49'),
 (10, 104, 1, '2, 6', '1, 4', '2020-01-11 18:34:49')]

In [140]:
%%sql
SELECT *
FROM customer_orders
WHERE exclusions = ''

 * sqlite:///datasets/pizza_runner.sqlite
Done.

[(1, 101, 1, '', '', '2020-01-01 18:05:02'),
 (2, 101, 1, '', '', '2020-01-01 19:00:52'),
 (3, 102, 1, '', '', '2020-01-02 23:51:23'),
 (3, 102, 2, '', '', '2020-01-02 23:51:23'),
 (5, 104, 1, '', '1', '2020-01-08 21:00:29'),
 (6, 101, 2, '', '', '2020-01-08 21:03:13'),
 (7, 105, 2, '', '1', '2020-01-08 21:20:29'),
 (8, 102, 1, '', '', '2020-01-09 23:54:33'),
 (10, 104, 1, '', '', '2020-01-11 18:34:49')]

### runner_orders

In [145]:
%%sql
SELECT *
FROM runner_orders

 * sqlite:///datasets/pizza_runner.sqlite
Done.

[(1, 1, '2020-01-01 18:15:34', '20km', '32 minutes', ''),
 (2, 1, '2020-01-01 19:10:54', '20km', '27 minutes', ''),
 (3, 1, '2020-01-03 00:12:37', '13.4km', '20 mins', None),
 (4, 2, '2020-01-04 13:53:03', '23.4', '40', None),
 (5, 3, '2020-01-08 21:10:57', '10', '15', None),
 (6, 3, 'null', 'null', 'null', 'Restaurant Cancellation'),
 (7, 2, '2020-01-08 21:30:45', '25km', '25mins', 'null'),
 (8, 2, '2020-01-10 00:15:02', '23.4 km', '15 minute', 'null'),
 (9, 2, 'null', 'null', 'null', 'Customer Cancellation'),
 (10, 1, '2020-01-11 18:50:20', '10km', '10minutes', 'null')]

In [146]:
%%sql
PRAGMA table_info(runner_orders)

 * sqlite:///datasets/pizza_runner.sqlite
Done.

[(0, 'order_id', 'INTEGER', 0, None, 0),
 (1, 'runner_id', 'INTEGER', 0, None, 0),
 (2, 'pickup_time', 'VARCHAR(19)', 0, None, 0),
 (3, 'distance', 'VARCHAR(7)', 0, None, 0),
 (4, 'duration', 'VARCHAR(10)', 0, None, 0),
 (5, 'cancellation', 'VARCHAR(23)', 0, None, 0)]

Replacing null with empty string under **cancellation** column

In [148]:
%%sql
UPDATE runner_orders
SET cancellation = ''
WHERE cancellation IS NULL

 * sqlite:///datasets/pizza_runner.sqlite
3 rows affected.

[]

Replacing string 'null' with empty string under **cancellation** column

In [149]:
%%sql
UPDATE runner_orders
SET cancellation = ''
WHERE cancellation = 'null'

 * sqlite:///datasets/pizza_runner.sqlite
3 rows affected.

[]

In [151]:
%%sql
SELECT DISTINCT cancellation
FROM runner_orders

 * sqlite:///datasets/pizza_runner.sqlite
Done.

[('',), ('Restaurant Cancellation',), ('Customer Cancellation',)]

Eliminating str "km" from column **distance**

In [152]:
%%sql
UPDATE runner_orders
SET distance = CAST(replace(distance,'km','') AS real)

 * sqlite:///datasets/pizza_runner.sqlite
10 rows affected.

[]

In [154]:
%%sql
UPDATE runner_orders
SET duration = REPLACE(duration,'minutes','')
WHERE duration LIKE '%min%';
 
UPDATE runner_orders
SET duration = REPLACE(duration,'minute','')
WHERE duration LIKE '%min%';

UPDATE runner_orders
SET duration = REPLACE(duration,'mins','')
WHERE duration LIKE '%min%';

UPDATE runner_orders
SET duration = CAST(duration AS INTEGER)

 * sqlite:///datasets/pizza_runner.sqlite
6 rows affected.
3 rows affected.
2 rows affected.
10 rows affected.

[]

In [172]:
%%sql
SELECT distance,duration
FROM runner_orders

 * sqlite:///datasets/pizza_runner.sqlite
Done.

[('20.0', '32'),
 ('20.0', '27'),
 ('13.4', '20'),
 ('23.4', '40'),
 ('10.0', '15'),
 ('0.0', '0'),
 ('25.0', '25'),
 ('23.4', '15'),
 ('0.0', '0'),
 ('10.0', '10')]

In [161]:
%%sql

SELECT datetime(pickup_time)
FROM runner_orders

 * sqlite:///datasets/pizza_runner.sqlite
Done.

[('2020-01-01 18:15:34',),
 ('2020-01-01 19:10:54',),
 ('2020-01-03 00:12:37',),
 ('2020-01-04 13:53:03',),
 ('2020-01-08 21:10:57',),
 (None,),
 ('2020-01-08 21:30:45',),
 ('2020-01-10 00:15:02',),
 (None,),
 ('2020-01-11 18:50:20',)]

In [155]:
%%sql
select *
FROM runner_orders

 * sqlite:///datasets/pizza_runner.sqlite
Done.

[(1, 1, '2020-01-01 18:15:34', '20.0', '32', ''),
 (2, 1, '2020-01-01 19:10:54', '20.0', '27', ''),
 (3, 1, '2020-01-03 00:12:37', '13.4', '20', ''),
 (4, 2, '2020-01-04 13:53:03', '23.4', '40', ''),
 (5, 3, '2020-01-08 21:10:57', '10.0', '15', ''),
 (6, 3, 'null', '0.0', '0', 'Restaurant Cancellation'),
 (7, 2, '2020-01-08 21:30:45', '25.0', '25', ''),
 (8, 2, '2020-01-10 00:15:02', '23.4', '15', ''),
 (9, 2, 'null', '0.0', '0', 'Customer Cancellation'),
 (10, 1, '2020-01-11 18:50:20', '10.0', '10', '')]

In [93]:
%%sql
PRAGMA TABLE_INFO(runners_orders)

 * sqlite:///datasets/pizza_runner.sqlite
Done.

[(0, 'order_id', 'INTEGER', 0, None, 0),
 (1, 'runner_id', 'INTEGER', 0, None, 0),
 (2, 'pickup_time', 'VARCHAR(19)', 0, None, 0),
 (3, 'distance', 'VARCHAR(7)', 0, None, 0),
 (4, 'duration', 'VARCHAR(10)', 0, None, 0),
 (5, 'cancellation', 'VARCHAR(23)', 0, None, 0)]

### pizza_name

There are only two entries for **pizza_name** with correct data type

In [164]:
%%sql
SELECT *
FROM pizza_names

 * sqlite:///datasets/pizza_runner.sqlite
Done.

[(1, 'Meatlovers'), (2, 'Vegetarian')]

In [167]:
%%sql
PRAGMA TABLE_INFO(pizza_names)

 * sqlite:///datasets/pizza_runner.sqlite
Done.

[(0, 'pizza_id', 'INTEGER', 0, None, 0), (1, 'pizza_name', 'TEXT', 0, None, 0)]

### pizza_recipes

In [168]:
%%sql
SELECT *
FROM pizza_recipes

 * sqlite:///datasets/pizza_runner.sqlite
Done.

[(1, '1, 2, 3, 4, 5, 6, 8, 10'), (2, '4, 6, 7, 9, 11, 12')]

In [169]:
%%sql
PRAGMA TABLE_INFO(pizza_recipes)

 * sqlite:///datasets/pizza_runner.sqlite
Done.

[(0, 'pizza_id', 'INTEGER', 0, None, 0), (1, 'toppings', 'TEXT', 0, None, 0)]

### pizza_toppings

In [170]:
%%sql
SELECT *
FROM pizza_toppings

 * sqlite:///datasets/pizza_runner.sqlite
Done.

[(1, 'Bacon'),
 (2, 'BBQ Sauce'),
 (3, 'Beef'),
 (4, 'Cheese'),
 (5, 'Chicken'),
 (6, 'Mushrooms'),
 (7, 'Onions'),
 (8, 'Pepperoni'),
 (9, 'Peppers'),
 (10, 'Salami'),
 (11, 'Tomatoes'),
 (12, 'Tomato Sauce')]

In [171]:
%%sql
PRAGMA TABLE_INFO(pizza_toppings)

 * sqlite:///datasets/pizza_runner.sqlite
Done.

[(0, 'topping_id', 'INTEGER', 0, None, 0),
 (1, 'topping_name', 'TEXT', 0, None, 0)]

#### Prev  : üçï <a href='case_study_2_pizza_part_1.ipynb'> Pizza Runner PART 1 </a>

#### Next : üçï <a href='case_study_2_pizza_part_3.ipynb'> Pizza Runner PART 3 </a>

#### Back to : <a href='https://github.com/sumedhadewan/test-repo' target='_blank'>Project Table of Content</a>